In [1]:
import pandas as pd

In [2]:
user_cols = ['user_id', 'years alive', 'Gender', 'Job','zip code']

finaltable = pd.read_table('http://files.grouplens.org/datasets/movielens/ml-100k/u.user',sep = '|', header=None, names = user_cols)

In [3]:
finaltable.head()

   user_id  years alive Gender         Job zip code
0        1           24      M  technician    85711
1        2           53      F       other    94043
2        3           23      M      writer    32067
3        4           24      M  technician    43537
4        5           33      F       other    15213

In [4]:
finaltable.describe()

          user_id  years alive
count  943.000000   943.000000
mean   472.000000    34.051962
std    272.364951    12.192740
min      1.000000     7.000000
25%    236.500000    25.000000
50%    472.000000    31.000000
75%    707.500000    43.000000
max    943.000000    73.000000

In [7]:
finaltable.shape #rows,col

(943, 5)

In [10]:
finaltable.dtypes

user_id         int64
years alive     int64
Gender         object
Job            object
zip code       object
dtype: object

In [15]:
finaltable.describe()

          user_id  years alive
count  943.000000   943.000000
mean   472.000000    34.051962
std    272.364951    12.192740
min      1.000000     7.000000
25%    236.500000    25.000000
50%    472.000000    31.000000
75%    707.500000    43.000000
max    943.000000    73.000000

In [16]:
finaltable.describe(include=['object']) #include=['object'] will only describe type of object

       Gender      Job zip code
count     943      943      943
unique      2       21      795
top         M  student    55414
freq      670      196        9